app/Controllers/Front/Unidades.php

    public function index($activo = 1)
    {
        $unidades = $this->unidades->where("activo", $activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1

    public function editar($id = null)
    {
        $unidades = $this->unidades->where('id', $id)->first();
---
SELECT *
FROM `unidades`
WHERE `id` = '1'
 LIMIT 1

    public function guardartest()
    {
        $data = [
            'nombre' => $this->request->getVar('nombre'),
            'nombre_corto' => $this->request->getVar('nombre_corto'),
            'titulo' => 'Agregar Unidad',
            'guardado' => 'Si',
        ];
        $this->unidades->save($data);
---
INSERT INTO `unidades` (`nombre`, `nombre_corto`, `fecha_alta`, `fecha_edit`) VALUES ('asas', 'asas', '2022-03-26 11:37:53', '2022-03-26 11:37:53')